app/controllers/school_classes_controller.rb

  def create
    # binding.pry
    @school_class = SchoolClass.new(post_params(:title, :room_number))
    @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Music 140"], ["room_number", 3160], ["created_at", "2018-08-29 19:11:38.026346"], ["updated_at", "2018-08-29 19:11:38.026346"]]

  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(post_params(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Fundamentals of Music"], ["room_number", 1108], ["updated_at", "2018-08-29 19:21:25.169905"], ["id", 1]]