app/controllers/students_controller.rb

  def create
    @student = Student.create(params.require(:student))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["created_at", "2017-10-04 04:24:12.154605"], ["updated_at", "2017-10-04 04:24:12.154605"]]